#+TITLE: SICP Exercises
#+OPTIONS: toc:3 tex:t
#+PROPERTY: header-args :tangle sicp-exercises.scm
*** Exercise 2.10
:LOGBOOK:
CLOCK: [2020-05-05 Tue 15:32]--[2020-05-05 Tue 16:00] =>  0:28
:END:
#+BEGIN_SRC scheme
(define (width-interval x)
  (/ (- (upper-bound x) (lower-bound x)) 2))
(define (mul-interval x y)
       (let ((p1 (* (lower-bound x) (lower-bound y)))
             (p2 (* (lower-bound x) (upper-bound y)))
             (p3 (* (upper-bound x) (lower-bound y)))
             (p4 (* (upper-bound x) (upper-bound y))))
         (make-interval (min p1 p2 p3 p4)
                        (max p1 p2 p3 p4))))
(define (div-interval x y)
  (if (= (width-interval y) 0)
      (error "Division by zero-width interval")
      (mul-interval x
      (make-interval (/ 1.0 (upper-bound y))
      (/ 1.0 (lower-bound y))))))
#+END_SRC
*** Exercise 2.11
:LOGBOOK:
CLOCK: [2020-05-05 Tue 16:06]--[2020-05-05 Tue 17:35] =>  1:29
:END:
If we're multiplying intervals $i=(a,b)$ and $j=(x,y)$ then we must have $a \leq
b$ and $x \leq y$ and so we have the following cases:
#+ATTR_HTML: :border 2 :rules all :frame border
|                   | $a \leq b < 0$ | $a < 0 \leq b$            | $0 \leq a \leq b$ |
|-------------------+----------------+---------------------------+-------------------|
| $x \leq y < 0$    | $(by,ax)$      | $(bx,ax)$                 | $(bx,ay)$         |
| $x < 0 \leq y$    | $(ay,ax)$      | $(min(ay,bx),min(ax,by))$ | $(bx,by)$         |
| $0 \leq x \leq y$ | $(ay,bx)$      | $(ay,by)$                 | $(ax,by)$         |
For simplicity's sake, we notice that multiplication is commutative
and simplify our table:
#+ATTR_HTML: :border 2 :rules all :frame border
|                   | $a \leq b < 0$ | $a < 0 \leq b$            | $0 \leq a \leq b$ |
|-------------------+----------------+---------------------------+-------------------|
| $x \leq y < 0$    | $(by,ax)$      | $(bx,ax)$                 | $(bx,ay)$         |
| $x < 0 \leq y$    | $j*i$          | $(min(ay,bx),min(ax,by))$ | $(bx,by)$         |
| $0 \leq x \leq y$ | $j*i$          | $j*i$                     | $(ax,by)$         |
#+BEGIN_SRC scheme
  (define (mul-interval i j)
    (let ((a (lower-bound i))
          (b (upper-bound i))
          (x (lower-bound j))
          (y (upper-bound j)))
      (cond ((< b 0) (if (< y 0)
                         (make-interval (* b y) (* a x))
                         (mul-interval j i)))
            ((< a 0) (cond ((< y 0) (make-interval (* b x) (* a x)))
                           ((< x 0) (make-interval (min (* a y) (* b x))
                                                   (max (* a x) (* b y))))
                           (else (mul-interval j i))))
            (else (cond ((< y 0) (make-interval (* b x) (* a y)))
                        ((< x 0) (make-interval (* b x) (* b y)))
                        (else (make-interval (* a x) (* b y))))))))
#+END_SRC
*** Exercise 2.13
:LOGBOOK:
CLOCK: [2020-05-05 Tue 17:52]--[2020-05-05 Tue 18:28] =>  0:36
:END:
Let interval $i$ have center $c_{i}$ and tolerance $p_{i}$. Let
interval $j$ have center $c_{j}$ and tolerance $p_{j}$. Then $i =
(c_{i}-c_{i}p_{i},c_{i}+c_{i}p_{i})$ and $j =
(c_{j}-c_{j}p_{j},c_{j}+c_{j}p_{j})$. Suppose $c_{i} > 0$ and $c_{j} >
0$. Then $$i*j =
((c_{i}-c_{i}p_{i})*(c_{j}-c_{j}p_{j}),(c_{i}+c_{i}p_{i})*(c_{j}+c_{j}p_{j}))$$
$$= (c_{i}(1-p_{i})c_{j}(1-p_{j}),c_{i}(1+p_{i})c_{j}(1+p_{j}))$$ $$=
(c_{i}c_{j}(1-p_{i})(1-p_{j}),c_{i}c_{j}(1+p_{i})(1+p_{j}))$$ Supposing
small percentage tolerances: $$=
(c_{i}c_{j}(1-p_{i}-p_{j}),c_{i}c_{j}(1+p_{i}+p_{j}))$$ Therefore $i*j$
is an interval centered at $c_{i}c_{j}$ with tolerance
$p_{i}+p_{j}$.
*** Exercise 2.14
:LOGBOOK:
CLOCK: [2020-05-05 Tue 18:33]--[2020-05-05 Tue 19:33] =>  1:00
:END:
#+BEGIN_SRC scheme
  (define (add-interval x y)
    (make-interval (+ (lower-bound x) (lower-bound y))
                   (+ (upper-bound x) (upper-bound y))))
  (define (par1 r1 r2)
    (div-interval (mul-interval r1 r2)
                  (add-interval r1 r2)))

    (define (par2 r1 r2)
      (let ((one (make-interval 1 1)))
        (div-interval one
                      (add-interval (div-interval one r1)
                                    (div-interval one r2)))))
#+END_SRC
Let $R_{1} = (a_{1},b_{1})$ and $R_{2} = (a_{2},b_{2})$. Expanding, we
see: $$\frac{R_{1}R_{2}}{R_{1}+R_{2}} =
(\frac{a_{1}a_{2}}{b_{1}+b_{2}},\frac{b_{1}b_{2}}{a_{1}+a_{2}})$$
$$\frac{1}{\frac{1}{R_{1}}+\frac{1}{R_{2}}} =
(\frac{a_{1}a_{2}}{a_{1}+a_{2}},\frac{b_{1}b_{2}}{b_{1}+b_{2}})$$ This
can be verified in the REPL.
*** Exercise 2.17
:LOGBOOK:
CLOCK: [2020-05-06 Wed 00:41]--[2020-05-06 Wed 00:45] =>  0:04
:END:
#+BEGIN_SRC scheme
  (define (last-pair l)
    (if (null? (cdr l))
        l
        (last-pair (cdr l))))
#+END_SRC
*** Exercise 2.18
:LOGBOOK:
CLOCK: [2020-05-06 Wed 01:07]--[2020-05-06 Wed 01:11] =>  0:04
CLOCK: [2020-05-06 Wed 00:46]--[2020-05-06 Wed 01:02] =>  0:16
:END:
Note that "nil" is no longer a part of the Scheme standard; we'll use
~()~ instead. See this [[https://stackoverflow.com/questions/9115703/null-value-in-mit-scheme][stackoverflow post]] for more.
#+BEGIN_SRC scheme
  (define (reverse l)
    (define (helper in out)
      (if (null? in)
          out
          (helper (cdr in) (cons (car in) out))))
    (helper l ()))
#+END_SRC
*** Exercise 2.19
:LOGBOOK:
CLOCK: [2020-05-06 Wed 01:12]--[2020-05-06 Wed 01:27] =>  0:15
:END:
#+BEGIN_SRC scheme
  (define no-more? null?)
  (define except-first-denomination cdr)
  (define first-denomination car)
  (define (cc amount coin-values)
    (cond ((= amount 0) 1)
          ((or (< amount 0) (no-more? coin-values)) 0)
          (else
           (+ (cc amount
                  (except-first-denomination coin-values))
              (cc (- amount
                     (first-denomination coin-values))
                  coin-values)))))
#+END_SRC
The order of the list coin-values still does not affect the
output because the procedure does not rely on any assumptions
regarding the order of coin-values.
*** Exercise 2.20
:LOGBOOK:
CLOCK: [2020-05-06 Wed 13:07]--[2020-05-06 Wed 13:29] =>  0:22
CLOCK: [2020-05-06 Wed 01:30]--[2020-05-06 Wed 01:32] =>  0:02
:END:
#+BEGIN_SRC scheme
  (define (same-parity? a b)
    (= (remainder a 2) (remainder b 2)))
  (define (same-parity x . l)
    (define (filterer sublist)
      (cond ((null? sublist) sublist)
            ((same-parity? x (car sublist))
             (cons (car sublist) (filterer (cdr sublist))))
            (else (filterer (cdr sublist)))))
    (cons x (filterer l)))
#+END_SRC
*** Exercise 2.22
:LOGBOOK:
CLOCK: [2020-05-06 Wed 13:47]--[2020-05-06 Wed 13:49] =>  0:02
:END:
Elements appearing first in the input list will be added to the head
of the ouput list before elements appearing later. Therefore, elements
appearing first in the input will appear later in the output.

Now, the output isn't a list.
*** Exercise 2.23
:LOGBOOK:
CLOCK: [2020-05-06 Wed 13:50]--[2020-05-06 Wed 14:18] =>  0:28
:END:
#+BEGIN_SRC scheme
    (define (for-each f l)
      (if (not (null? l))
          (begin (f (car l))
                 (for-each f (cdr l)))))
#+END_SRC
